from math import exp

LAMBDA = [
    [300, 1.36e-2],
    [500, 1.63e-2],
    [800, 1.81e-2],
    [1100, 1.98e-2],
    [2000, 2.5e-2],
    [2400, 2.74e-2]
]

K = [
    [293, 2e-2],
    [1278, 5e-2],
    [1528, 7.8e-2],
    [1677, 1e-1],
    [2000, 1.3e-1],
    [2400, 2e-1]
]

r0 = 0.35
R = 0.5
np = 0
sigma = 5.668e-12
T0 = 300
F0 = 150
ALPHA = 0.05
F_MAX = 1  # 5000  # амплитуда импульса (определяет крутизну фронтов)
t_MAX = 3000
# 150 определяет длительность импульса
F = lambda t: F_MAX / t_MAX * t * exp(-t / t_MAX + 1)
F_const = lambda t: F0
F_freq = 4e3
h = 1e-3
tau = 1
temp_eps = 1e-6
energy_eps = 1e-4

max_iters = 2000
max_t = t_MAX * 50

a2 = 2.049
b2 = 0.563 * 10 ** -3
c2 = 0.528 * 10 ** 5
m2 = 1

c_NEAR_ZERO = 10 ** -1
MAX_it = 60
